{"config": [{"class_name": "Lambda", "config": {"output_shape": null, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00faAC:/Users/ogawa/udacity/CarND-Behavioral-Cloning-P3/train/train.py\u00da\b<lambda>w\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw", "batch_input_shape": [null, 160, 320, 3], "arguments": {}, "function_type": "lambda", "trainable": true, "input_dtype": "float32", "name": "lambda_1"}}, {"class_name": "Cropping2D", "config": {"trainable": true, "cropping": [[70, 25], [0, 0]], "name": "cropping2d_1"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "bias": true, "nb_filter": 24, "nb_row": 5, "b_regularizer": null, "border_mode": "valid", "name": "convolution2d_1", "b_constraint": null, "W_constraint": null, "nb_col": 5, "trainable": true, "subsample": [2, 2], "activation": "relu", "dim_ordering": "tf", "W_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "bias": true, "nb_filter": 36, "nb_row": 5, "b_regularizer": null, "border_mode": "valid", "name": "convolution2d_2", "b_constraint": null, "W_constraint": null, "nb_col": 5, "trainable": true, "subsample": [2, 2], "activation": "relu", "dim_ordering": "tf", "W_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "bias": true, "nb_filter": 48, "nb_row": 5, "b_regularizer": null, "border_mode": "valid", "name": "convolution2d_3", "b_constraint": null, "W_constraint": null, "nb_col": 5, "trainable": true, "subsample": [2, 2], "activation": "relu", "dim_ordering": "tf", "W_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "bias": true, "nb_filter": 64, "nb_row": 3, "b_regularizer": null, "border_mode": "valid", "name": "convolution2d_4", "b_constraint": null, "W_constraint": null, "nb_col": 3, "trainable": true, "subsample": [1, 1], "activation": "relu", "dim_ordering": "tf", "W_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "bias": true, "nb_filter": 64, "nb_row": 3, "b_regularizer": null, "border_mode": "valid", "name": "convolution2d_5", "b_constraint": null, "W_constraint": null, "nb_col": 3, "trainable": true, "subsample": [1, 1], "activation": "relu", "dim_ordering": "tf", "W_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_2"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias": true, "input_dim": 2112, "b_regularizer": null, "W_regularizer": null, "name": "dense_1", "activation": "linear", "W_constraint": null, "trainable": true, "b_constraint": null, "output_dim": 100, "init": "glorot_uniform"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias": true, "input_dim": 100, "b_regularizer": null, "W_regularizer": null, "name": "dense_2", "activation": "linear", "W_constraint": null, "trainable": true, "b_constraint": null, "output_dim": 50, "init": "glorot_uniform"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias": true, "input_dim": 50, "b_regularizer": null, "W_regularizer": null, "name": "dense_3", "activation": "linear", "W_constraint": null, "trainable": true, "b_constraint": null, "output_dim": 10, "init": "glorot_uniform"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias": true, "input_dim": 10, "b_regularizer": null, "W_regularizer": null, "name": "dense_4", "activation": "linear", "W_constraint": null, "trainable": true, "b_constraint": null, "output_dim": 1, "init": "glorot_uniform"}}], "class_name": "Sequential", "keras_version": "1.2.1"}