{"config": [{"config": {"output_shape_type": "raw", "function_type": "lambda", "batch_input_shape": [null, 160, 320, 3], "trainable": true, "output_shape": null, "arguments": {}, "input_dtype": "float32", "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00faAC:/Users/ogawa/udacity/CarND-Behavioral-Cloning-P3/train/train.py\u00da\b<lambda>x\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}, "class_name": "Lambda"}, {"config": {"cropping": [[70, 25], [0, 0]], "trainable": true, "name": "cropping2d_1"}, "class_name": "Cropping2D"}, {"config": {"dim_ordering": "tf", "activity_regularizer": null, "activation": "relu", "W_regularizer": null, "trainable": true, "nb_col": 5, "init": "glorot_uniform", "border_mode": "valid", "b_regularizer": null, "nb_filter": 24, "bias": true, "b_constraint": null, "W_constraint": null, "nb_row": 5, "subsample": [2, 2], "name": "convolution2d_1"}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "activity_regularizer": null, "activation": "relu", "W_regularizer": null, "trainable": true, "nb_col": 5, "init": "glorot_uniform", "border_mode": "valid", "b_regularizer": null, "nb_filter": 36, "bias": true, "b_constraint": null, "W_constraint": null, "nb_row": 5, "subsample": [2, 2], "name": "convolution2d_2"}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "activity_regularizer": null, "activation": "relu", "W_regularizer": null, "trainable": true, "nb_col": 5, "init": "glorot_uniform", "border_mode": "valid", "b_regularizer": null, "nb_filter": 48, "bias": true, "b_constraint": null, "W_constraint": null, "nb_row": 5, "subsample": [2, 2], "name": "convolution2d_3"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"dim_ordering": "tf", "activity_regularizer": null, "activation": "relu", "W_regularizer": null, "trainable": true, "nb_col": 3, "init": "glorot_uniform", "border_mode": "valid", "b_regularizer": null, "nb_filter": 64, "bias": true, "b_constraint": null, "W_constraint": null, "nb_row": 3, "subsample": [1, 1], "name": "convolution2d_4"}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "activity_regularizer": null, "activation": "relu", "W_regularizer": null, "trainable": true, "nb_col": 3, "init": "glorot_uniform", "border_mode": "valid", "b_regularizer": null, "nb_filter": 64, "bias": true, "b_constraint": null, "W_constraint": null, "nb_row": 3, "subsample": [1, 1], "name": "convolution2d_5"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "bias": true, "activation": "linear", "trainable": true, "W_regularizer": null, "input_dim": 2112, "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "output_dim": 100, "W_constraint": null, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "bias": true, "activation": "linear", "trainable": true, "W_regularizer": null, "input_dim": 100, "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "output_dim": 50, "W_constraint": null, "name": "dense_2"}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "bias": true, "activation": "linear", "trainable": true, "W_regularizer": null, "input_dim": 50, "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "output_dim": 10, "W_constraint": null, "name": "dense_3"}, "class_name": "Dense"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "bias": true, "activation": "linear", "trainable": true, "W_regularizer": null, "input_dim": 10, "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "output_dim": 1, "W_constraint": null, "name": "dense_4"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}